# Иван Васильевич пришел на рынок и решил купить
# два арбуза: один для себя, а другой для тещи.
# Понятно, что для себя нужно выбрать арбуз потяжелей,
# а для тещи полегче. Но вот незадача: арбузов слишком
# много и он не знает как же выбрать самый легкий
# и самый тяжелый арбуз? Помогите ему!

# Пользователь вводит одно число N – количество арбузов.
# Вторая строка содержит N чисел, записанных на новой
# строчке каждое. Здесь каждое число – это масса соответствующего арбуза
#5 => 5 1 6 5 9 min = 1 max= 9

num = int(input("Введите кол-во арбузов"))
min = 1000
max = 0
for i in range(num):
    weight = int(input("Введите вес арбуов: "))
    if weight > max:
         max = weight
    else:
        if weight < min:
            min = weight
print(min, max)             